In [53]:
import pandas as pd

In [54]:
df = pd.read_csv("Titanic.csv")

In [55]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [56]:
df.loc[99]

PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                         34.0
SibSp                          1
Parch                          0
Ticket                    244367
Fare                        26.0
Cabin                        NaN
Embarked                       S
Name: 99, dtype: object

In [57]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [58]:
num_males = (df['Sex'] == 'male').sum()

In [59]:
print(f'Number of males: {num_males}')

Number of males: 577

In [60]:
df.loc[5, 'Age'] = 28

In [61]:
print(df.loc[5])

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                        28.0
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [62]:
num_males = (df['Sex'] == 'male').sum()

In [63]:
total_entries = len(df)

In [64]:
percentage_males = (num_males / total_entries) * 100

In [65]:
print(f'Percentage of males: {percentage_males:.2f}%')

Percentage of males: 64.76%

In [70]:
count = 0
for person in df["Age"]:
    if person > 18:
        count = count +1
count

576

In [74]:
count = (df['Age'] > 18).sum()

In [76]:
print(count)

64.75869809203144

In [75]:
count = 0 
for person in df ["Sex"]:
    if person == "male":
        count = count + 1 
        
count = (count / len(df)) * 100
count

64.75869809203144

In [77]:
frequency_table = df['Embarked'].value_counts()

In [78]:
print(frequency_table)

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [79]:
total_tickets_sold = frequency_table.sum()

In [80]:
print(f'Total tickets sold on Titanic\'s maiden voyage: {total_tickets_sold}')

Total tickets sold on Titanic's maiden voyage: 889

In [81]:
port_counts = df['Embarked'].value_counts()

In [82]:
relative_frequencies = port_counts / port_counts.sum()

In [83]:
percentages = relative_frequencies * 100

In [85]:
print(percentages)

S    72.440945
C    18.897638
Q     8.661417
Name: Embarked, dtype: float64